luis9am/Piano-Simulator-on-MSP430/project/project_demo/switches.c
#include <msp430.h>
#include "switches.h"
#include "led.h"

char switch_state_down, switch_state_changed; /* effectively boolean */
char btn1, btn2, btn3, btn4;

static char 
switch_update_interrupt_sense()
{
  char p1val = P1IN;
  /* update switch interrupt to detect changes from current buttons */
  P1IES |= (p1val & SWITCHES);	/* if switch up, sense down */
  P1IES &= (p1val | ~SWITCHES);	/* if switch down, sense up */
  return p1val;
}

void 
switch_init()			/* setup switch */
{  
  P1REN |= SWITCHES;		/* enables resistors for switches */
  P1IE = SWITCHES;		/* enable interrupts from switches */
  P1OUT |= SWITCHES;		/* pull-ups for switches */
  P1DIR &= ~SWITCHES;		/* set switches' bits for input */
  switch_update_interrupt_sense();
  switch_interrupt_handler();	/* to initially read the switches */
}

void
switch_interrupt_handler()
{
  char p1val = switch_update_interrupt_sense();
    switch_state_down |= (p1val & SW1) ? 0 : 1; /* 0 when SW1-SW4 is up */
    switch_state_down |= (p1val & SW2) ? 0 : 1;
    switch_state_down |= (p1val & SW3) ? 0 : 1;
    switch_state_down |= (p1val & SW4) ? 0 : 1;
    btn1 = (p1val & SW1) ? 0 : 1;    /* apply switch operations to btn1-btn4  */
    btn2 = (p1val & SW2) ? 0 : 1;
    btn3 = (p1val & SW3) ? 0 : 1;
    btn4 = (p1val & SW4) ? 0 : 1;
  switch_state_changed = 1;
  led_update();
}
